# GetProjectFullPath

## Description
Gets the path and filename of the Project File for Project Sharing.

```pascal
FUNCTION GetProjectFullPath(VAR fullPath : STRING): BOOLEAN;
```

```python
def vs.GetProjectFullPath():
    return (BOOLEAN, fullPath)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fullPath|STRING|   |

## Version
Availability: from Vectorworks 2016

## Category
* Project Sharing